import React from "react";
import { Link } from "react-router-dom";
import {Images} from "./imgconst.js"

function Thought () {

    return(
        <div className="thougtsContainer container">
            
            <div className="row my-3">
                <div className="col-lg-12">
                    <div className="arthpurn_vyakhya">
                        <div>
                            <h4>श्री गुरु चरण सरोज रज, निज मन मुकुरु सुधारि।
                            बरनऊं रघुवर बिमल जसु, जो दायकु फल चारि।</h4>
                            <p>अर्थ- श्री गुरु महाराज के चरण कमलों की धूलि से अपने मन रूपी दर्पण को पवित्र करके श्री 
                            रघुवीर के निर्मल यश का वर्णन करता हूं, जो चारों फल धर्म, अर्थ, काम और मोक्ष को देने वाला है।</p>
                        </div>
                        <div>
                            <h4>बुद्धिहीन तनु जानिके, सुमिरो पवन-कुमार।
                            बल बुद्धि विद्या देहु मोहिं, हरहु कलेश विकार।</h4>
                            <p>अर्थ- हे पवन कुमार! मैं आपको सुमिरन करता हूं। आप तो जानते ही हैं कि मेरा शरीर और बुद्धि निर्बल है। 
                            मुझे शारीरिक बल, सद्‍बुद्धि एवं ज्ञान दीजिए और मेरे दुखों व दोषों का नाश कार दीजिए।</p>
                        </div>
                        <div>
                            <h4>जय हनुमान ज्ञान गुण सागर, जय कपीस तिहुं लोक उजागर॥1॥</h4>
                            <p>अर्थ- श्री हनुमान जी! आपकी जय हो। आपका ज्ञान और गुण अथाह है। 
                            हे कपीश्वर! आपकी जय हो! तीनों लोकों, स्वर्ग लोक, भूलोक और पाताल लोक में आपकी कीर्ति है।</p>
                        </div>
                        <div>
                            <h4>राम दूत अतुलित बलधामा, अंजनी पुत्र पवन सुत नामा॥2॥</h4>
                            <p>अर्थ- हे पवनसुत अंजनी नंदन! आपके समान दूसरा बलवान नहीं है।</p>
                        </div>
                        <div>
                            <h4>महावीर विक्रम बजरंगी, कुमति निवार सुमति के संगी॥3॥</h4>
                            <p>अर्थ- हे महावीर बजरंग बली!आप विशेष पराक्रम वाले है। 
                            आप खराब बुद्धि को दूर करते है, और अच्छी बुद्धि वालों के साथी, सहायक है।</p>
                        </div>
                        <div>
                            <h4>कंचन बरन बिराज सुबेसा, कानन कुण्डल कुंचित केसा॥4॥</h4>
                            <p>अर्थ- आप सुनहले रंग, सुन्दर वस्त्रों, कानों में कुण्डल और घुंघराले बालों से सुशोभित हैं।</p>
                        </div>
                        <div>
                            <h4>हाथबज्र और ध्वजा विराजे, कांधे मूंज जनेऊ साजै॥5॥</h4>
                            <p>अर्थ- आपके हाथ में बज्र और ध्वजा है और कन्धे पर मूंज के जनेऊ की शोभा है।</p>
                        </div>
                        <div>
                            <h4>शंकर सुवन केसरी नंदन, तेज प्रताप महा जग वंदन॥6॥</h4>
                            <p>अर्थ- शंकर के अवतार! हे केसरी नंदन आपके पराक्रम और महान यश की संसार भर में वन्दना होती</p>
                        </div>
                        <div>
                            <h4>विद्यावान गुणी अति चातुर, राम काज करिबे को आतुर॥7॥</h4>
                            <p>अर्थ- आप प्रकान्ड विद्या निधान है, गुणवान और अत्यन्त कार्य कुशल होकर श्री राम के काज करने के लिए आतुर रहते है।</p>
                        </div>
                        <div>
                            <h4>प्रभु चरित्र सुनिबे को रसिया, राम लखन सीता मन बसिया॥8॥</h4>
                            <p>अर्थ- आप श्री राम चरित सुनने में आनन्द रस लेते है। श्री राम, सीता और लखन आपके हृदय में बसे रहते है।</p>
                        </div>
                        <div>
                            <h4>सूक्ष्म रूप धरि सियहिं दिखावा, बिकट रूप धरि लंक जरावा॥9॥</h4>
                            <p>अर्थ- आपने अपना बहुत छोटा रूप धारण करके सीता जी को दिखलाया और भयंकर रूप करके लंका को जलाया।</p>
                        </div>
                        <div>
                            <h4>भीम रूप धरि असुर संहारे, रामचन्द्र के काज संवारे॥10॥</h4>
                            <p>अर्थ- आपने विकराल रूप धारण करके राक्षसों को मारा और श्री रामचन्द्र जी के उद्‍देश्यों को सफल कराया।</p>
                        </div>
                        <div>
                            <h4>लाय सजीवन लखन जियाये, श्री रघुवीर हरषि उर लाये॥11॥</h4>
                            <p>अर्थ- आपने संजीवनी बूटी लाकर लक्ष्मण जी को जिलाया जिससे श्री रघुवीर ने हर्षित होकर आपको हृदय से लगा लिया।</p>
                        </div>
                        <div>
                            <h4>रघुपति कीन्हीं बहुत बड़ाई, तुम मम प्रिय भरत सम भाई॥12॥</h4>
                            <p>अर्थ- श्री रामचन्द्र ने आपकी बहुत प्रशंसा की और कहा कि तुम मेरे भरत जैसे प्यारे भाई हो।</p>
                        </div>
                        <div>
                            <h4>सहस बदन तुम्हरो जस गावैं। अस कहि श्रीपति कंठ लगावैं॥13॥</h4>
                            <p>अर्थ- श्री राम ने आपको यह कहकर हृदय से लगा लिया की तुम्हारा यश हजार मुख से सराहनीय है।</p>
                        </div>
                        <div>
                            <h4>सनकादिक ब्रह्मादि मुनीसा,  नारद, सारद सहित अहीसा॥14॥</h4>
                            <p>अर्थ-  श्री सनक, श्री सनातन, श्री सनन्दन, श्री सनत्कुमार आदि मुनि ब्रह्मा आदि देवता नारद जी, सरस्वती जी, शेषनाग जी सब आपका गुण गान करते है।</p>
                        </div>
                        <div>
                            <h4>जम कुबेर दिगपाल जहां ते, कबि कोबिद कहि सके कहां ते॥15॥</h4>
                            <p>अर्थ- यमराज, कुबेर आदि सब दिशाओं के रक्षक, कवि विद्वान, पंडित या कोई भी आपके यश का पूर्णतः वर्णन नहीं कर सकते।</p>
                        </div>
                        <div>
                            <h4>जम कुबेर दिगपाल जहां ते, कबि कोबिद कहि सके कहां ते॥15॥</h4>
                            <p>अर्थ- यमराज, कुबेर आदि सब दिशाओं के रक्षक, कवि विद्वान, पंडित या कोई भी आपके यश का पूर्णतः वर्णन नहीं कर सकते।</p>
                        </div>
                        <div>
                            <h4>तुम उपकार सुग्रीवहि कीन्हा, राम मिलाय राजपद दीन्हा॥16॥</h4>
                            <p>अर्थ- आपने सुग्रीव जी को श्रीराम से मिलाकर उपकार किया, जिसके कारण वे राजा बने।</p>
                        </div>
                        <div>
                            <h4>तुम्हरो मंत्र विभीषण माना, लंकेस्वर भए सब जग जाना॥17॥</h4>
                            <p>अर्थ- आपके उपदेश का विभिषण जी ने पालन किया जिससे वे लंका के राजा बने, इसको सब संसार जानता है।</p>
                        </div>
                        <div>
                            <h4>जुग सहस्त्र जोजन पर भानू, लील्यो ताहि मधुर फल जानू॥18॥</h4>
                            <p>अर्थ- जो सूर्य इतने योजन दूरी पर है कि उस पर पहुंचने के लिए हजार युग लगे। दो हजार योजन की दूरी पर स्थित सूर्य को आपने एक मीठा फल समझकर निगल लिया।</p>
                        </div>
                        <div>
                            <h4>प्रभु मुद्रिका मेलि मुख माहि, जलधि लांघि गये अचरज नाहीं॥19॥</h4>
                            <p>अर्थ- आपने श्री रामचन्द्र जी की अंगूठी मुंह में रखकर समुद्र को लांघ लिया, इसमें कोई आश्चर्य नहीं है।</p>
                        </div>
                        <div>
                            <h4>दुर्गम काज जगत के जेते, सुगम अनुग्रह तुम्हरे तेते॥20॥</h4>
                            <p>अर्थ- संसार में जितने भी कठिन से कठिन काम हो, वो आपकी कृपा से सहज हो जाते है।</p>
                        </div>
                        <div>
                            <h4>राम दुआरे तुम रखवारे, होत न आज्ञा बिनु पैसा रे॥21॥</h4>
                            <p>अर्थ- श्री रामचन्द्र जी के द्वार के आप रखवाले है, जिसमें आपकी आज्ञा बिना किसी को प्रवेश नहीं मिलता अर्थात् आपकी प्रसन्नता के बिना राम कृपा दुर्लभ है।</p>
                        </div>
                        <div>
                            <h4>सब सुख लहै तुम्हारी सरना, तुम रक्षक काहू को डरना ॥22॥</h4>
                            <p>अर्थ- जो भी आपकी शरण में आते है, उस सभी को आनन्द प्राप्त होता है, और जब आप रक्षक है, तो फिर किसी का डर नहीं रहता।</p>
                        </div>
                        <div>
                            <h4>आपन तेज सम्हारो आपै, तीनों लोक हांक तें कांपै॥23॥</h4>
                            <p>अर्थ- आपके सिवाय आपके वेग को कोई नहीं रोक सकता, आपकी गर्जना से तीनों लोक कांप जाते है।</p>
                        </div>
                        <div>
                            <h4>भूत पिशाच निकट नहिं आवै, महावीर जब नाम सुनावै॥24॥</h4>
                            <p>अर्थ- जहां महावीर हनुमान जी का नाम सुनाया जाता है, वहां भूत, पिशाच पास भी नहीं फटक सकते।</p>
                        </div>
                        <div>
                            <h4>नासै रोग हरै सब पीरा, जपत निरंतर हनुमत बीरा ॥25॥</h4>
                            <p>अर्थ- वीर हनुमान जी! आपका निरंतर जप करने से सब रोग चले जाते है और सब पीड़ा मिट जाती है।</p>
                        </div>
                        <div>
                            <h4>संकट तें हनुमान छुड़ावै, मन क्रम बचन ध्यान जो लावै॥26॥</h4>
                            <p>अर्थ- हे हनुमान जी! विचार करने में, कर्म करने में और बोलने में, जिनका ध्यान आपमें रहता है, उनको सब संकटों से आप छुड़ाते है।</p>
                        </div>
                        <div>
                            <h4>सब पर राम तपस्वी राजा, तिनके काज सकल तुम साजा॥27॥</h4>
                            <p>अर्थ- तपस्वी राजा श्री रामचन्द्र जी सबसे श्रेष्ठ है, उनके सब कार्यों को आपने सहज में कर दिया।</p>
                        </div>
                        <div>
                            <h4>और मनोरथ जो कोइ लावै, सोई अमित जीवन फल पावै॥28॥</h4>
                            <p>अर्थ- जिस पर आपकी कृपा हो, वह कोई भी अभिलाषा करें तो उसे ऐसा फल मिलता है जिसकी जीवन में कोई सीमा नहीं होती।</p>
                        </div>
                        <div>
                            <h4>चारों जुग परताप तुम्हारा, है परसिद्ध जगत उजियारा॥29॥</h4>
                            <p>अर्थ- चारो युगों सतयुग, त्रेता, द्वापर तथा कलियुग में आपका यश फैला हुआ है, जगत में आपकी कीर्ति सर्वत्र प्रकाशमान है।</p>
                        </div>
                        <div>
                            <h4>साधु सन्त के तुम रखवारे, असुर निकंदन राम दुलारे॥30॥</h4>
                            <p>अर्थ- हे श्री राम के दुलारे! आप सज्जनों की रक्षा करते है और दुष्टों का नाश करते है।</p>
                        </div>
                        <div>
                            <h4>अष्ट सिद्धि नौ निधि के दाता, अस बर दीन जानकी माता॥31॥</h4>
                            <p>अर्थ- आपको माता श्री जानकी से ऐसा वरदान मिला हुआ है, जिससे आप किसी को भी आठों सिद्धियां और नौ निधियां दे सकते है।</p>
                            <ol>
                                <li>अणिमा- जिससे साधक किसी को दिखाई नहीं पड़ता और कठिन से कठिन पदार्थ में प्रवेश कर जाता है।</li>
                                <li>महिमा- जिसमें योगी अपने को बहुत बड़ा बना देता है।</li>
                                <li>गरिमा- जिससे साधक अपने को चाहे जितना भारी बना लेता है।</li>
                                <li>लघिमा- जिससे जितना चाहे उतना हल्का बन जाता है।</li>
                                <li>प्राप्ति- जिससे इच्छित पदार्थ की प्राप्ति होती है।</li>
                                <li>प्राकाम्य- जिससे इच्छा करने पर वह पृथ्वी में समा सकता है, आकाश में उड़ सकता है।</li>
                                <li>ईशित्व- जिससे सब पर शासन का सामर्थ्य हो जाता है।</li>
                                <li>वशित्व- जिससे दूसरों को वश में किया जाता है।</li>
                            </ol>
                        </div>
                        <div>
                            <h4>राम रसायन तुम्हरे पासा, सदा रहो रघुपति के दासा॥32॥</h4>
                            <p>अर्थ- आप निरंतर श्री रघुनाथ जी की शरण में रहते है, जिससे आपके पास बुढ़ापा और असाध्य रोगों के नाश के लिए राम नाम औषधि है।</p>
                        </div>
                        <div>
                            <h4>तुम्हरे भजन राम को पावै, जनम जनम के दुख बिसरावै॥33॥</h4>
                            <p>अर्थ- आपका भजन करने से श्री राम जी प्राप्त होते है और जन्म जन्मांतर के दुख दूर होते है।</p>
                        </div>
                        <div>
                            <h4>अन्त काल रघुबर पुर जाई, जहां जन्म हरि भक्त कहाई॥34॥</h4>
                            <p>अर्थ- अंत समय श्री रघुनाथ जी के धाम को जाते है और यदि फिर भी जन्म लेंगे तो भक्ति करेंगे और श्री राम भक्त कहलाएंगे।</p>
                        </div>
                        <div>
                            <h4>और देवता चित न धरई, हनुमत सेई सर्व सुख करई॥35॥</h4>
                            <p>अर्थ- हे हनुमान जी! आपकी सेवा करने से सब प्रकार के सुख मिलते है, फिर अन्य किसी देवता की आवश्यकता नहीं रहती।</p>
                        </div>
                        <div>
                            <h4>संकट कटै मिटै सब पीरा, जो सुमिरै हनुमत बलबीरा॥36॥</h4>
                            <p>अर्थ- हे वीर हनुमान जी! जो आपका सुमिरन करता रहता है, उसके सब संकट कट जाते है और सब पीड़ा मिट जाती है।</p>
                        </div>
                        <div>
                            <h4>जय जय जय हनुमान गोसाईं, कृपा करहु गुरु देव की नाई॥37॥</h4>
                            <p>अर्थ- हे स्वामी हनुमान जी! आपकी जय हो, जय हो, जय हो! आप मुझ पर कृपालु श्री गुरु जी के समान कृपा कीजिए।</p>
                        </div>
                        <div>
                            <h4>जो सत बार पाठ कर कोई, छूटहि बंदि महा सुख होई॥38॥</h4>
                            <p>अर्थ- जो कोई इस हनुमान चालीसा का सौ बार पाठ करेगा वह सब बंधनों से छूट जाएगा और उसे परमानन्द मिलेगा।</p>
                        </div>
                        <div>
                            <h4>जो यह पढ़ै हनुमान चालीसा, होय सिद्धि साखी गौरीसा॥39॥</h4>
                            <p>अर्थ- भगवान शंकर ने यह हनुमान चालीसा लिखवाया, इसलिए वे साक्षी है, कि जो इसे पढ़ेगा उसे निश्चय ही सफलता प्राप्त होगी।</p>
                        </div>
                        <div>
                            <h4>तुलसीदास सदा हरि चेरा, कीजै नाथ हृदय मंह डेरा॥40॥</h4>
                            <p>अर्थ- हे नाथ हनुमान जी! तुलसीदास सदा ही श्री राम का दास है। इसलिए आप उसके हृदय में निवास कीजिए।</p>
                        </div>
                        <div>
                            <h4>पवन तनय संकट हरन, मंगल मूरति रूप। राम लखन सीता सहित, हृदय बसहु सूरभूप॥</h4>
                            <p>अर्थ- हे संकट मोचन पवन कुमार! आप आनंद मंगलों के स्वरूप हैं। हे देवराज! आप श्री राम, सीता जी और लक्ष्मण सहित मेरे हृदय में निवास कीजिए।</p>
                        </div>
                    </div>
                </div>
                <div className="col-lg-6">
                    <div className="content_show">
                        <h4>सर्व मंगल मांगल्ये शिवे सर्वार्थ साधिके। 
                        शरन्ये त्रयम्बिके गौरी नारायणी नमोस्तुते।।</h4>
                        <p>सनातन धर्म से संबंध रखने वाले लोग किसी भी शुभ कार्य करने से पहले इस मंत्र का उच्चारण अवश्य करते है। इस मंत्र के उच्चारण से जीवन मे शांति व समृद्धि आती है। इस लेख में हम आपको इस मंत्र का भावार्थ बताने जा रहे हैं।</p>
                        <p>भावार्थ - यह मन्त्र दुर्गासप्तशति का है, इसका हिन्दी अर्थ यह है कि :- नारायणी तुम सब प्रकार का मंगल प्रदान करने वाली मंगलमयी हो, कल्याणदायिनी शिवा हो, सब पुरुषार्थो को सिद्ध करनेवाली, शरणागतवत्सला, तीन नेत्रों वाली एवं गौरी हो। हे माँ दुर्गा आपके श्री चरणों में नमस्कार है।</p>
                    </div>
                </div>
                <div className="col-lg-6">
                    <div className="content_show">
                        <h4>अवन्तिकायां विहितावतारं मुक्तिप्रदानाय च सज्जनानाम्। अकालमृत्यो: परिरक्षणार्थं वन्दे महाकालमहासुरेशम्।</h4>
                        <p>जो भगवान् शंकर संतजनों को मोक्ष प्रदान करने के लिए अवन्तिकापुरी उज्जैन में अवतार धारण किए हैं, अकाल मृत्यु से बचने के लिए उन देवों के भी देव महाकाल नाम से विख्यात महादेव जी को मैं नमस्कार करता हूँ । नमस्कार करता हूँ ।</p>
                    </div>
                </div>
                <div className="col-lg-6">
                    <div className="content_show">
                        <h4>"पापोहं पापकर्माहं पापात्मा पाप संभवः"। "त्राहिमां पुण्डरीकाक्षः सर्वपाप हरो हरी"। <br/> "त्राहिमां पार्वतीनाथ सर्वपापहरो हर</h4>
                        <p>मैं पापी हूँ। मेरे कर्म पापमय हैं। मेरी आत्मा पापी है। मैं पाप से उत्पन्न हुआ हूँ। मुझे बचाओ। हे कमल जैसे नेत्रों वाले भगवान। हे सभी पापों को हरने वाले हरि (विष्णु)।</p>
                        <p>मुझे बचाओ। हे पार्वती के स्वामी। हे सभी पापों को नष्ट करने वाले। </p>
                    </div>
                </div>
            </div>
            <div className="row">
                <div className="col-lg-4">
                    <Link to="/vyakhan">
                        <div className="thoughtsContent">
                            <div className="thoughtsContent_img">
                                <img src={Images.Bhishma_URL} alt="character-img" className="img-fluid" />
                            </div>
                            <h3>Bhsihma Pitamah</h3>
                            <p>Legend of Kurushetra mahayudh, fighting against dharm , Fighting against pandav Putra</p>
                        </div>
                    </Link>
                </div>

            </div>
        </div>
    );
}

export default Thought;